
# 1.数据的读取 -----------------------------------------------------------------


# 1.1文库路径的设置 --------------------------------------------------------------


# 2.从文件中读取数据后的存储形式 --------------------------------------------------------


# 2.1数据框 ------------------------------------------------------------------

# 数据框操作

# 2.2向量 -------------------------------------------------------------------



# 3.数据的预处理 ----------------------------------------------------------------


# 4.ggplot2绘图 -------------------------------------------------------------


# 5.数据的写出与图形的保存 -----------------------------------------------------------


# 6.命令行中运行R脚本 -------------------------------------------------------------




a = c(1,2,3,4,-1,3)
b <- c("ni","hao","world")
c <- c(TRUE,FALSE,TRUE,FALSE)

#向量取子集
x <- c("cat", "dog", "mouse", "human")
x[1] #取出第一个元素，要注意的是R和Python等不一样的地方是，index是从1开始
的而不是从0开始的。
x[-2] #去掉第二个元素，这里-号的意义和Python里也是不一样的。
x[-c(1,3)]
x[10] #R里超过了向量的长度取值也不会报错，而是返回NA值
#向量的取值和替换
x[3] <- "mice" # 可以看到，是很容易对向量里的值进行替换
x[10] <- "aaa"




x<-c(10,6,4,7,8)  
min(x);
max(x);range(x)
which.min(x)
which.max(x)
#数据框
data.frame()
df<-data.frame(
  Name<-c("alice","becka","james","jeffrey","john"),
  Sex<-c("f","f","m","m","m"),
  Age=c(13,14,12,15,11),
  Height=c(56.5,45.5,56.4,47.8,56.7),
  weight=c(84.2,88.3,79.3,79.9,84.3)
)
as.data.frame()
is.data.frame(df)

#数据框取子集
#第1种方法:采用下标
df[1,1]
df[1,]
df[,1]
df[1:2,3:5]
df[c(1,3),c(3,5)]

df**“Height”++  #采用[[]]引用
  
  
  
#第2种方法：采用列名方式取子集  #只能取列，必须有列名
colnames(df)[c(1,2)]=c("name","sex")
df$weight  #采用$引用
names(df)  #数据框变量名定义
df[,5]
df$weight

rownames(df)<-c(“one”,”two”,”three”,”four”,”five”)  #行定义
attach() #将数据框的变量链接到内存中，还可以链接列表
attach(df)
df$r<-Heighy/weight 
detach() #取消链接
with()  #部分数据处理
df$r<-with(df, Heighy/weight)


#因子
data<-c(1,2,3,3,1,2,2,3,1,3,2,1)
fdata<-factor(data)

rdata<-factor(data,labels=c("A","B","C"))
levels(rdata)  #查看因子水平  levels（rdata）
table(rdata)  #统计因子中个水平出现的频数  table(rdata)
